Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИнгредиентыВНаличии</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчёты</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПродуктов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницаИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СкидкиНаПродукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаПродукты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПроверкаРолиНаСервере.ЕстьРоль("Директор") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Заведение = ПараметрыСеанса.ТекущийСотрудник.Заведение;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыКоличествоПриИзменении(Элемент)
	РасчетЦены();	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыЦенаПриИзменении(Элемент)
	РасчетЦены();
КонецПроцедуры 

&НаКлиенте
Процедура РасчетЦены()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
	Скидка = Число(СтрЗаменить(ТекущиеДанные.Скидка, "%", "")); 
    ТекущиеДанные.ИтоговаяСумма = ТекущиеДанные.Сумма * (1 - Скидка / 100);

    ПерерасчетСуммДокумента();
		
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные.Цена <> 0 Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.Сумма / ТекущиеДанные.Цена;
		МожетБытьДробным = ПерерасчетСуммКлиент.МожетБытьДробным(ТекущиеДанные.ЕдиницаИзмерения);
		Если НЕ МожетБытьДробным Тогда
			ТекущиеДанные.Количество = Цел(ТекущиеДанные.Количество);
			Если ТекущиеДанные.Количество <> 0 Тогда
				ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
			Иначе
				РасчетЦены();
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	ПерерасчетСуммДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПерерасчетСкидокНаПродукты();
КонецПроцедуры

&НаСервере
Функция ПродуктыПродуктПриИзмененииНаСервере(Продукт)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СкидкиНаПродуктыСрезПоследних.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.СкидкиНаПродукты.СрезПоследних(&ДатаДокумента,) КАК СкидкиНаПродуктыСрезПоследних
	|ГДЕ
	|	СкидкиНаПродуктыСрезПоследних.Продукт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Продукт);
	
	Выборка = Запрос.Выполнить().Выбрать();
 	Выборка.Следующий();
	
	Скидка = Выборка.Скидка;
	
	Возврат Скидка;
	
КонецФункции

&НаКлиенте
Процедура ПродуктыПродуктПриИзменении(Элемент)
	Продукт = Элементы.Товары.ТекущиеДанные.Номенклатура;
	СкидкаПродукта = ПродуктыПродуктПриИзмененииНаСервере(Продукт);
	СкидкаДоговора = ПерерасчетСуммКлиент.ПолучитьСкидкуИзДоговора(Объект.Договор, Объект.Дата);
	Если СкидкаДоговора = Неопределено Тогда
		ВариантСкидки = ПерерасчетСуммКлиент.ПолучитьСкидку(Объект.Договор);
		СкидкаДоговора = ПосчитатьСкидку(ВариантСкидки);
	КонецЕсли;
	ИтоговаяСкидка = 0;
	Если СкидкаПродукта <> Неопределено И СкидкаПродукта > СкидкаДоговора Тогда
		ИтоговаяСкидка = СкидкаПродукта;
	Иначе
		ИтоговаяСкидка = СкидкаДоговора;  
	КонецЕсли; 
	
	Элементы.Товары.ТекущиеДанные.Скидка = "" + ИтоговаяСкидка + "%";
	Элементы.Товары.ТекущиеДанные.ИтоговаяСумма = Элементы.Товары.ТекущиеДанные.Сумма * (1 - ИтоговаяСкидка / 100);
	
	ПерерасчетСуммДокумента();
КонецПроцедуры   

&НаКлиенте
Процедура ПерерасчетСуммДокумента()
	Продукты = Объект.Товары;
	Объект.СуммаДоСкидки = Продукты.Итог("Сумма");
	Объект.СуммаДокумента = Продукты.Итог("ИтоговаяСумма");	
КонецПроцедуры   


&НаКлиенте
Процедура ПерерасчетСкидокНаПродукты()
	Продукты = Объект.Товары;
	МассивПродуктов = Новый Массив;
	Для Каждого Строка Из Продукты Цикл
		МассивПродуктов.Добавить(Строка.Продукт);
	КонецЦикла;
	
	СкидкиНаПродукты = ПерерасчетСуммКлиент.ПолучитьСкидкиНаПродукты(МассивПродуктов, Объект.Дата);
	СкидкаДоговора = ПерерасчетСуммКлиент.ПолучитьСкидкуИзДоговора(Объект.Договор, Объект.Дата);
	Если СкидкаДоговора = Неопределено Тогда
		ВариантСкидки = ПерерасчетСуммКлиент.ПолучитьСкидку(Объект.Договор);
		СкидкаДоговора = ПосчитатьСкидку(ВариантСкидки);
	КонецЕсли;
	
	Для Каждого Строка Из Продукты Цикл
		СкидкаПродукта = СкидкиНаПродукты[Строка.Продукт];
		ИтоговаяСкидка = 0;
		Если СкидкаПродукта <> Неопределено И СкидкаПродукта > СкидкаДоговора Тогда
			ИтоговаяСкидка = СкидкаПродукта;
		Иначе
			ИтоговаяСкидка = СкидкаДоговора;
		КонецЕсли;
		Строка.Скидка = "" + ИтоговаяСкидка + "%";
		Строка.ИтоговаяСумма = Строка.Сумма * (1 - ИтоговаяСкидка / 100);
	КонецЦикла;
	
	ПерерасчетСуммДокумента();
КонецПроцедуры
